{
    "boxShadow": "{{appsmith.theme.boxShadow.appBoxShadow}}",
    "widgetName": "Iframe1",
    "borderColor": "#ef4444",
    "srcDoc": "<div style=\"font-family: Verdana, Arial, Tahoma, Serif; background-color:white; \">\n<h3>Setup<\/h3>\nShuffle the deck. Deal 5 cards to each game player.\nSet balls in center of playing surface for the number of players minus 1. Always include the orange ball.\n\n<p style=\"font-style: italic\"><b>Example:<\/b> If 5 players will be playing, place 3 WHITE balls and 1 ORANGE ball in the center of the table.<\/p>\n\n<p>\nFinally, shuffle the deck and deal 5 cards to each player. Players can pick up their cards and look at them but shouldn't let others see their hands.\n<\/p>\n\n<h3>The Snap<\/h3>\nThe game starts with the winner of the last game calling out \"HIKE!\". If this is your first game then the youngest player gets the call. \n\n<h3>The Play<\/h3>\n<p>\nTo start the game, the dealer picks a card from the deck and passes one card to their left. Players pick from their right and pass left. The last player puts their discard onto a pile.\n\n<p>\nPlayers continue passing cards until a player gets 5 matching position cards.\nIf the dealer runs out of cards to draw from in the deck, they start picking from the last player's discard pile.\n\n<p>\nThe player who got 5 matching position cards quickly (and possibly secretly) grabs the orange TOUCHDOWN ball (+6) from the center of the table. \n<\/p>\n<p>\nOnce the orange TOUCHDOWN ball has been snagged, the remaining players scramble to grab one of the remaining white balls as quickly as possible (IT'S A FUMBLE!). One of the players will be left without a ball. \n<\/p>\n\n<h3>Kicks<\/h3>\nWith all of the balls recovered, the game shifts to kicking time. The player with the orange ball goes first, setting the cup up about a foot away and bouncing the orange ball off the table to try to hit an extra point (+1). The remaining players take shots with their white FIELD GOAL balls (+3). \n\n<p style=\"font-style: italic\"><b>Note:<\/b> Don't be afraid to move the cup further back for a more challenging shot! \n<\/p>\n\n<h3>Scoring<\/h3>\n<p>\nIn the standard game, the player who recovered the orange TOUCHDOWN ball receives 6 points plus an additional point if they made their extra point attempt. Any player that hit a shot with a white FIELD GOAL ball gets 3 points. \n<\/p>\n\n<h3>Winning<\/h3>\nThe standard game is over once someone scores more than 21 points. \n<\/div>",
    "displayName": "Iframe",
    "iconSVG": "/static/media/icon.34169b6acebc8ace125dd1f638974aae.svg",
    "searchTags": ["embed"],
    "topRow": 0,
    "bottomRow": 54,
    "parentRowSpace": 10,
    "source": "",
    "type": "IFRAME_WIDGET",
    "hideCard": false,
    "borderOpacity": "0",
    "animateLoading": true,
    "parentColumnSpace": 10.53125,
    "dynamicTriggerPathList": [],
    "leftColumn": 0,
    "dynamicBindingPathList": [
        {"key": "borderRadius"},
        {"key": "boxShadow"}
    ],
    "borderWidth": "0",
    "key": "evh4gch20d",
    "isDeprecated": false,
    "rightColumn": 64,
    "widgetId": "a724w1piom",
    "isVisible": true,
    "version": 1,
    "parentId": "61ovq2nrw3",
    "renderMode": "CANVAS",
    "isLoading": false,
    "borderRadius": "{{appsmith.theme.borderRadius.appBorderRadius}}"
}